Q1. Problem Statement: Combining DataFrames -IWrite a Python program with two DataFrames, with columns “name” and “age”. Now,  combine  both  the  DataFrames  vertically  using  the concat()function, without the duplicate rows, and print the final DataFrame.

In [3]:
import pandas as pd
d={'name':['shubham','Adin','Rahul'],
  'age':[23,28,30]}
Q1=pd.DataFrame(d)
display(Q1)
df={'name':['Amrit','shubham','Ali'],
  'age':[20,23,28]}
Q2=pd.DataFrame(df)
display(Q2)

      name  age
0  shubham   23
1     Adin   28
2    Rahul   30

      name  age
0    Amrit   20
1  shubham   23
2      Ali   28

In [14]:
pd.concat([Q1,Q2])

      name  age
0  shubham   23
1     Adin   28
2    Rahul   30
0    Amrit   20
1  shubham   23
2      Ali   28

Q2. Problem Statement: Combining DataFrames -IIWrite  a  Python  programto  create  two  DataFrames.  First  DataFrame  with columns “employee”and “department,”Second  DataFrame  with  columns “employee”and “joining_date,” and Perform the following tasks:

1.Merge the DataFrames based on the “employee”column

2.Display the final DataFrame with employees records who are working in the “Engineering” department